Revit 2024 API
BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsError Property
 The solution is failing to do segments which are parallel and should intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailToIntersectParallelSegmentsError { get; }
Visual Basic
Public Shared ReadOnly Property FailToIntersectParallelSegmentsError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailToIntersectParallelSegmentsError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace